rails-marathon/app/controllers/galleries_controller.rb

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    @gallery = Gallery.new(gallery_params)

    if @gallery.save
---
INSERT INTO "galleries" ("name", "city", "state", "zipcode", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"