rails-marathon/app/controllers/paintings_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @painting = Painting.new
    @gallery = Gallery.find(params[:gallery_id])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "paintings" ("title", "artist", "gallery_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Study in Green"], ["artist", "Mickey"], ["gallery_id", 1], ["created_at", 2017-03-03 02:02:59 UTC], ["updated_at", 2017-03-03 02:02:59 UTC]]
---
  def create
    @gallery = Gallery.find(params[:gallery_id])
    @painting = Painting.new(painting_params)
    @painting.gallery = @gallery

    if @painting.save